tsung_test/test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="ec2-52-27-107-83.us-west-2.compute.amazonaws.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <!-- start out at the landing page. -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is checking our page out -->
      <thinktime value="2" random="true"></thinktime>

      <!-- user signs up  -->
      <request>
        <http url='/users/sign_up' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is filling out sign up page -->
      <thinktime value="2" random="true"></thinktime>

      <!-- generate a random number for the username and email -->
      <setdynvars sourcetype="random_number" start="1" end="999999">
        <var name="rand_user_num" />
      </setdynvars>

      <!-- send information for signing up -->
      <request subst="true">
        <http
          url='/users'
          version='1.1'
          method='POST'
          contents='user%5Bemail%5D:%%_rand_user_num%%%40blah.com&amp;
          user%5Busername%5D:%%_rand_user_num%%&amp;
          user%5Bpassword%5D:12345678&amp;
          user%5Bpassword_confirmation%5D:12345678&amp;
          commit:Sign+me+up%21'>
        </http>
      </request>

      <!-- send signout request -->
      <request subst="true">
        <http
          url='/users/sign_out'
          version='1.1'
          method='POST'
          contents='_method: delete'>
        </http>
      </request>

    </session>
  </sessions>
</tsung>